In [3]:
# List of high schools
high_schools = ["Hernandez High School", 
                "Figueroa High School",
                "Wilson High School",
                "Wright High School"]

for schoolName in high_schools:
    print(schoolName)

Hernandez High School
Figueroa High School
Wilson High School
Wright High School

In [4]:
# A dictionary of high schools and the type of school.
high_school_types = [{"High School": "Griffin", "Type":"District"},
                    {"High School": "Figueroa", "Type": "District"},
                    {"High School": "Wilson", "Type": "Charter"},
                    {"High School": "Wright", "Type": "Charter"}]

for schoolDetails in high_school_types:
    print(schoolDetails)

{'High School': 'Griffin', 'Type': 'District'}
{'High School': 'Figueroa', 'Type': 'District'}
{'High School': 'Wilson', 'Type': 'Charter'}
{'High School': 'Wright', 'Type': 'Charter'}

In [7]:
# List of high schools
high_schools = ["Huang High School", "Figueroa High School", "Shelton High School", "Hernandez High School","Griffin High School","Wilson High School", "Cabrera High School", "Bailey High School", "Holden High School", "Pena High School", "Wright High School","Rodriguez High School", "Johnson High School", "Ford High School", "Thomas High School"]

In [10]:
!pip3 install pandas

Collecting pandas
  Downloading pandas-1.4.4-cp310-cp310-macosx_10_9_x86_64.whl (11.5 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 11.5/11.5 MB 13.1 MB/s eta 0:00:0000:0100:01
Collecting pytz>=2020.1
  Downloading pytz-2022.2.1-py2.py3-none-any.whl (500 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 500.6/500.6 kB 9.3 MB/s eta 0:00:0000:01
Requirement already satisfied: python-dateutil>=2.8.1 in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (from pandas) (2.8.2)
Collecting numpy>=1.21.0
  Downloading numpy-1.23.3-cp310-cp310-macosx_10_9_x86_64.whl (18.1 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 18.1/18.1 MB 9.3 MB/s eta 0:00:00:00:0100:01
Requirement already satisfied: six>=1.5 in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Installing collected packages: pytz, numpy, pandas
Successfully installed numpy-1.23.3 pandas-1.4.4 pytz-2022.2.1

In [2]:
# Add the Pandas dependency.
import pandas as pd

In [4]:
# Create a Pandas Series from a list.
school_series = pd.Series(high_schools)
school_series

NameError: name 'high_schools' is not defined

In [5]:
for school in school_series:
    print(school)

NameError: name 'school_series' is not defined

In [6]:
# A dictionary of high schools
high_school_dicts = [{"School ID": 0, "school_name": "Huang High School", "type": "District"},
                    {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                    {"School ID": 2, "school_name":"Shelton High School", "type": "Charter"},
                    {"School ID": 3, "school_name":"Hernandez High School", "type": "District"},
                    {"School ID": 4, "school_name":"Griffin High School", "type": "Charter"}]

In [7]:
school_df = pd.DataFrame(high_school_dicts)
school_df

   School ID            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [8]:
# Three separate lists of information on high schools
school_id = [0, 1, 2, 3, 4]

school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]

type_of_school = ["District", "District", "Charter", "District","Charter"]

In [9]:
# Initialize a new DataFrame.
schools_df = pd.DataFrame()

In [10]:
# Add the list to a new DataFrame.
schools_df["School ID"] = school_id
schools_df["School Name"] = school_name
schools_df["Type"] = type_of_school

# Print the DataFrame.
schools_df

   School ID            School Name      Type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [11]:
# Create a dictionary of information on high schools.
high_schools_dict = {'School ID': school_id, 'school_name':school_name, 'type':type_of_school}

In [12]:
schools_df = pd.DataFrame(high_schools_dict)
schools_df

   School ID            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [13]:
schools_df.columns

Index(['School ID', 'school_name', 'type'], dtype='object')

In [14]:
schools_df.index

RangeIndex(start=0, stop=5, step=1)

In [15]:
schools_df.values

array([[0, 'Huang High School', 'District'],
       [1, 'Figueroa High School', 'District'],
       [2, 'Shelton High School', 'Charter'],
       [3, 'Hernandez High School', 'District'],
       [4, 'Griffin High School', 'Charter']], dtype=object)

In [16]:
school_ids = (0, 1, 2 , 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14)
school_names = ("Huang High School", "Figueroa High School", "Shelton High School", "Hernandez High School", "Griffin High School", "Wilson High School", "Cabrera High School", "Bailey High School", "Holden High School", "Pena High School", "Wright High School", "Rodriquez High School", "Johnson High School", "Ford High School", "Thomas High School")
types = ("District", "District", "Charter", "District", "Charter", "Charter", "Charter", "District", "Charter", "Charter", "Charter", "District", "District", "District", "Charter")

In [18]:
school_details_df = pd.DataFrame()

school_details_df["School IDs"] = school_ids
school_details_df["School Names"] = school_names
school_details_df["Types"] = types

school_details_df

    School IDs           School Names     Types
0            0      Huang High School  District
1            1   Figueroa High School  District
2            2    Shelton High School   Charter
3            3  Hernandez High School  District
4            4    Griffin High School   Charter
5            5     Wilson High School   Charter
6            6    Cabrera High School   Charter
7            7     Bailey High School  District
8            8     Holden High School   Charter
9            9       Pena High School   Charter
10          10     Wright High School   Charter
11          11  Rodriquez High School  District
12          12    Johnson High School  District
13          13       Ford High School  District
14          14     Thomas High School   Charter

In [27]:
import pandas as pd
import os

student_df = pd.read_csv(os.path.join('new_student_data.csv'))
student_df.tail()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type
13935,32277979,Kelly Myers,10th,Sullivan High School,62.3,37.9,Public
13936,109412748,Kimberly Burke,10th,Montgomery High School,99.5,89.8,Public
13937,16856426,Crystal Merritt,9th,Turner High School,86.3,71.1,Public
13938,88213835,Misty Wiggins,10th,Fisher High School,75.4,76.4,Public
13939,12153644,Michele Jones,11th,Chang High School,69.0,72.4,Public

In [28]:
student_df["student_id"]

0        127008367
1         33365505
2         44359500
3         24791243
4        121467881
           ...
13935     32277979
13936    109412748
13937     16856426
13938     88213835
13939     12153644
Name: student_id, Length: 13940, dtype: int64

In [2]:
import pandas as pd
import numpy as np

apple_df = pd.DataFrame({"AAPL": [72.27, np.nan, 74.39, np.nan, 75.94, 76.93,np.nan, 78.74, np.nan, 79.81, np.nan, 79.53, np.nan, 79.56, 79.49]})

pd.isnull(apple_df).sum()

AAPL    6
dtype: int64

In [3]:
import pandas as pd
import numpy as np
daily_returns = pd.DataFrame({
    "AAPL": [0.5, np.nan, 0.62],
    "GOOG": [0.45, 0.63, 0.55]
})

#daily_returns
daily_returns.fillna(daily_returns.mean())

   AAPL  GOOG
0  0.50  0.45
1  0.56  0.63
2  0.62  0.55

In [9]:
import pandas as pd
best_actors_df = pd.DataFrame({
    "Best Actors": ["Nic Cage", "Nic Cage", "Harrison Ford"]
})
best_actors_df

best_actors_df.duplicated().sum()

1

In [10]:
best_actors_df = best_actors_df.drop_duplicates()
best_actors_df

     Best Actors
0       Nic Cage
2  Harrison Ford

In [2]:
import pandas as pd

prices = pd.DataFrame({
    "price_usd": ["$0.53", "$0.22", "0.34"]
})

prices

  price_usd
0     $0.53
1     $0.22
2      0.34

In [20]:
prices.dtypes

price_usd    object
dtype: object

In [11]:
import warnings
warnings.simplefilter(action='ignore', category=FutureWarning)

prices.loc[:, "price_usd"] = prices.loc[:, "price_usd"].str.replace("$", "")
prices

  price_usd
0      0.53
1      0.22
2      0.34

In [30]:
prices.dtypes

price_usd    object
dtype: object

In [31]:
prices.loc[:, "price_usd"] = prices.loc[:, "price_usd"].astype("float")
prices

   price_usd
0       0.53
1       0.22
2       0.34

In [32]:
prices.dtypes

price_usd    float64
dtype: object

In [3]:
prices.describe()

       price_usd
count          3
unique         3
top        $0.53
freq           1

In [4]:
sales_df = pd.DataFrame({"item": ["tomatoes", "onions", "potatoes", "tomatoes", "mushrooms"],
                "quantity": [15, 26, 10, 12, 2],
                "total_price": [50.25, 39.52, 50.01, 40.20, 8.46]})
sales_df.head()

        item  quantity  total_price
0   tomatoes        15        50.25
1     onions        26        39.52
2   potatoes        10        50.01
3   tomatoes        12        40.20
4  mushrooms         2         8.46

In [9]:
sales_df.describe(include="all")

            item   quantity  total_price
count          5   5.000000     5.000000
unique         4        NaN          NaN
top     tomatoes        NaN          NaN
freq           2        NaN          NaN
mean         NaN  13.000000    37.688000
std          NaN   8.717798    17.128761
min          NaN   2.000000     8.460000
25%          NaN  10.000000    39.520000
50%          NaN  12.000000    40.200000
75%          NaN  15.000000    50.010000
max          NaN  26.000000    50.250000

In [12]:
sales_df.mean()

quantity       13.000
total_price    37.688
dtype: float64

In [13]:
sales_df.max()

item           tomatoes
quantity             26
total_price       50.25
dtype: object

In [15]:
sales_df["total_price"].min()

8.46

In [6]:
# Create a DataFrame
aapl_returns = pd.DataFrame({"AAPL": [0.5, 0.56, 0.59, 0.52, 0.1]})

# Select the first row using iloc
#aapl_returns
aapl_returns.iloc[0]

AAPL    0.5
Name: 0, dtype: float64

In [8]:
aapl_returns.iloc[0:3]

   AAPL
0  0.50
1  0.56
2  0.59

In [13]:
aapl_returns = pd.DataFrame({"AAPL": [0.5, 0.56, 0.59, 0.52, 0.1, 0.75, 0.47]})

aapl_returns.iloc[-3:]
aapl_returns.iloc[4:]

   AAPL
4  0.10
5  0.75
6  0.47

In [14]:
import numpy as np
revenue_df = pd.DataFrame(
    np.random.randint(low=1, high=1000, size=1000),
    index=pd.date_range('1/1/2017', periods=1000),
    columns=["revenue"])
revenue_df.tail()

            revenue
2019-09-23      290
2019-09-24      840
2019-09-25       29
2019-09-26      581
2019-09-27      279

In [17]:
# Select the last quarter of 2018 to the first quarter of 2019
revenue_df.loc['2018-10-01':'2019-03-31']

            revenue
2018-10-01       69
2018-10-02      404
2018-10-03      446
2018-10-04      588
2018-10-05      289
...             ...
2019-03-27      733
2019-03-28       86
2019-03-29      300
2019-03-30      443
2019-03-31      544

[182 rows x 1 columns]

In [18]:
revenue_df.loc['2018-10-01':'2019-03-31'].describe()

          revenue
count  182.000000
mean   514.302198
std    281.511061
min      3.000000
25%    284.500000
50%    496.500000
75%    738.500000
max    991.000000

In [19]:
revenue_df.loc["2018-10-01":"2019-03-31"].count()

revenue    182
dtype: int64

In [20]:
sales_df = pd.DataFrame({"item": ["tomatoes", "onions", "potatoes", "tomatoes", "mushrooms"],
                "quantity": [15, 26, 10, 12, 2],
                "total_price": [50.25, 39.52, 50.01, 40.20, 8.46]})
sales_df.head()

        item  quantity  total_price
0   tomatoes        15        50.25
1     onions        26        39.52
2   potatoes        10        50.01
3   tomatoes        12        40.20
4  mushrooms         2         8.46

In [21]:
sales_df["quantity"] > 10

0     True
1     True
2    False
3     True
4    False
Name: quantity, dtype: bool

In [22]:
sales_df.loc[sales_df["quantity"] > 10]

       item  quantity  total_price
0  tomatoes        15        50.25
1    onions        26        39.52
3  tomatoes        12        40.20

In [23]:
sales_df = pd.DataFrame({"item": ["tomatoes", "onions", "potatoes", "tomatoes", "mushrooms"],
                "quantity": [15, 26, 10, 12, 2],
                "total_price": [50.25, 39.52, 50.01, 40.20, 8.46]})

In [27]:
sales_df.loc[(sales_df["quantity"] > 10) & (sales_df["total_price"] < 45)]

       item  quantity  total_price
1    onions        26        39.52
3  tomatoes        12        40.20

In [28]:
sales_df.loc[(sales_df["quantity"] > 10) | (sales_df["total_price"] < 45)]

        item  quantity  total_price
0   tomatoes        15        50.25
1     onions        26        39.52
3   tomatoes        12        40.20
4  mushrooms         2         8.46

In [2]:
import pandas as pd

sales_df = pd.DataFrame({
    "item": ["tomatoes", "onions", "potatoes", "tomatoes", "mushrooms", "potatoes", "onions", "tomatoes", "onions", "tomatoes"],
    "store": ["Downtown", "Downtown", "Midtown", "Midtown", "Downtown", "Midtown", "Downtown", "Midtown", "Midtown", "Midtown"],
    "quantity": [15, 26, 10, 12, 2, 3, 17, 16, 20, 9],
    "total_price": [50.25, 39.52, 50.10, 40.20, 8.46, 15.03, 25.84, 53.60, 30.40, 30.15]})
sales_df

        item     store  quantity  total_price
0   tomatoes  Downtown        15        50.25
1     onions  Downtown        26        39.52
2   potatoes   Midtown        10        50.10
3   tomatoes   Midtown        12        40.20
4  mushrooms  Downtown         2         8.46
5   potatoes   Midtown         3        15.03
6     onions  Downtown        17        25.84
7   tomatoes   Midtown        16        53.60
8     onions   Midtown        20        30.40
9   tomatoes   Midtown         9        30.15

In [6]:
item_group_df = sales_df.groupby("item")
item_group_df.mean()

           quantity  total_price
item
mushrooms       2.0        8.460
onions         21.0       31.920
potatoes        6.5       32.565
tomatoes       13.0       43.550

In [16]:
store_item_group_df = sales_df.groupby(["store", "item"])
store_item_group_df.max()

                    quantity  total_price
store    item
Downtown mushrooms         2         8.46
         onions           26        39.52
         tomatoes         15        50.25
Midtown  onions           20        30.40
         potatoes         10        50.10
         tomatoes         16        53.60